// 자동 스크롤 JS : jquery-autoScroll-1.0.js //

////////////////// 로딩구역 ////////////////////
$(function(){ ////// jQB //////////////////////

    /************************************************* 
        [ 자동스크롤 구현 ]

        1. 기능: 마우스휠을 위나 아래로 작동시킬때
        페이지가 위나 아래로 자동으로 애니메이션 되는 기능

        2. 이벤트: 마우스휠을 움직일때 발생하는 이벤트는?
        - mousewheel (오리지널 이벤트) 

    *************************************************/


}); ////////////// jQB /////////////////////////
////////////////////////////////////////////////